In [7]:
import pandas as pd
import numpy as np

In [50]:
# Lendo o arquivo parquet
df = pd.read_parquet(r"C:\Users\fmath\Documents\base_anac_tratada.parquet")

df.head()

    ano  mes empresa origem destino  tarifa  assentos
0  2017    1     AZU   SBRJ    SBGO  396.67        14
1  2017    1     AZU   SBFZ    SBBE   338.9        55
2  2017    1     AZU   SBSV    SBGL   274.9         6
3  2017    1     AZU   SBCF    SBGR   470.9         1
4  2017    1     AZU   SBEG    SBCY   586.9         5

In [51]:
df[['ano', 'mes']].reset_index().groupby(['ano', 'mes']).count().reset_index().pivot(index='ano', columns='mes', values='index')

mes,1,2,3,4,5,6,7,8,9,10,11,12
ano,,,,,,,,,,,,
2017,319640,267057,344798,269977,386152,425856,427531,443428,507113,491775,475749,394731

In [39]:
pd.read_csv(r"C:\Users\fmath\OneDrive\Área de Trabalho\201711.CSV", sep=None, engine='python', encoding='latin'
            , usecols=['Ano de Referência', 'Mês de Referência', 'ICAO Empresa Aérea',
                                                                'ICAO Aeródromo Origem', 'ICAO Aeródromo Destino', 'Tarifa-N',
                                                                'Assentos Comercializados'])

,Ano de Referência,Mês de Referência,ICAO Empresa Aérea,ICAO Aeródromo Origem,ICAO Aeródromo Destino,Tarifa-N,Assentos Comercializados
0,2017,11,AZU,SBAE,SBAR,"1059,9",1
1,2017,11,AZU,SBAE,SBAR,"1123,09",1
2,2017,11,AZU,SBAE,SBAR,"350,9",1
3,2017,11,AZU,SBAE,SBAR,"660,9",1
4,2017,11,AZU,SBAE,SBAR,"822,9",1
...,...,...,...,...,...,...,...
476002,2017,11,TAM,SWGN,SBGO,579,2
476003,2017,11,TAM,SWGN,SBGR,659,2
476004,2017,11,TAM,SWGN,SBKP,"1083,01",2
476005,2017,11,TAM,SWGN,SBSL,2155,1
476006,2017,11,TAM,SWGN,SBSV,"881,01",1

In [20]:
# Traznedo a dimensão de aeroportos
aeroportos = pd.read_csv(r"C:\Users\fmath\Documents\dados-viagens-anac\dados-viagens-anac\data\outras_bases\cadastro-de-aerodromos-civis-publicos.csv"
            , sep=';', skiprows=1, usecols=['CÓDIGO OACI', 'CIAD', 'NOME', 'MUNICÍPIO ATENDIDO', 'UF'])

aeroportos.rename(columns={'CÓDIGO OACI': 'oaci', 'NOME': 'aeroporto', 'MUNICÍPIO ATENDIDO':'municipio'}, inplace=True)

,CÓDIGO OACI,CIAD,NOME,MUNICÍPIO ATENDIDO,UF
0,SBAA,PA0008,CONCEIÇÃO DO ARAGUAIA,CONCEIÇÃO DO ARAGUAIA,PA
1,SBAE,SP0010,BAURU/AREALVA,BAURU,SP
2,SBAQ,SP0012,BARTOLOMEU DE GUSMÃO,ARARAQUARA,SP
3,SBAR,SE0001,SANTA MARIA,ARACAJU,SE
4,SBAT,MT0003,PILOTO OSVALDO MARQUES DIAS,ALTA FLORESTA,MT
...,...,...,...,...,...
500,SJO9,BA0253,SENHOR DO BONFIM,SENHOR DO BONFIM,BA
501,SBPW,RJ0321,PORTO DO AÇU,SÃO JOÃO DA BARRA,RJ
502,SSBG,RS0091,MUNICIPAL DE BENTO GONÇALVES,BENTO GONÇALVES,RS
503,-,SC0020,ISMAEL NUNES,SÃO JOAQUIM,SC
504,SND6,SC0012,DIONÍSIO CERQUEIRA,DIONÍSIO CERQUEIRA,SC